wambd/certification2/confirmRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pac="http://packages.servicePackage.dome.com/">
<soapenv:Header/>
<soapenv:Body>
   <pac:confirm>
      <arg0>
         <agencyReference>REFERENCIA TEST</agencyReference>
         <flightInformation>
            <arrivalAirport>LHR</arrivalAirport>
            <company>IB</company>
            <departureAirport>SCL</departureAirport>
            <flightInOut>I</flightInOut>
            <flightLocalDateTime>2020/02/01 13:25</flightLocalDateTime>
            <flightNumber>3524</flightNumber>
         </flightInformation>
         <flightInformation>
            <arrivalAirport>SCL</arrivalAirport>
            <company>IB</company>
            <departureAirport>MAD</departureAirport>
            <flightInOut>O</flightInOut>
            <flightLocalDateTime>2020/02/05 18:25</flightLocalDateTime>
            <flightNumber>3523</flightNumber>
         </flightInformation>
         
         <!--El campo "ideses" es obligatorio-->
         <ideses>WAW#40292#219180234658010</ideses>
         <pax>
               <age>30</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA1</firstName>
               <lastName>APELLIDOTESTA1</lastName>
               <paxId>1</paxId>
               <phone></phone>
            </pax>
            <pax>
               <age>35</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA2</firstName>
               <lastName>APELLIDOTESTA2</lastName>
               <paxId>2</paxId>
               <phone></phone>
            </pax>  
            <pax>
               <age>40</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA3</firstName>
               <lastName>APELLIDOTESTA3</lastName>
               <paxId>3</paxId>
               <phone></phone>
            </pax>
            <pax>
               <age>39</age>
               <documentNumber></documentNumber>
               <firstName>NOMBRETESTA4</firstName>
               <lastName>APELLIDOTESTA4</lastName>
               <paxId>4</paxId>
               <phone></phone>
            </pax> 
         <remark>
            <code>1</code>
            <type>AGE</type>
            <value>COMENTARIOS SOBRE LA RESERVA</value>
         </remark>
      </arg0>

   </pac:confirm>
</soapenv:Body>
</soapenv:Envelope>